#+Startup: overview
#+TITLE: Emacs Configuration
#+AUTHOR: Brian O'Reilly
#+EMAIL: <fade@deepsky.com>
#+OPTIONS: toc:4 h:4
#+ATTR_HTML: :style margin-left: auto; margin-right: auto;

** Dired
Dired configuration is split between =init.el= and this clause in =config.org=, for reasons related to the way that emacs is initialised in this regime. If dired is not configured early, emacs throws to the debugger with an error when dired is called in regular use.
#+BEGIN_SRC emacs-lisp
  (use-package dired-single
    :ensure t
    :after dired)

  (use-package all-the-icons-dired
    :ensure t
    :after dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+END_SRC

#+RESULTS:
| dired-extra-startup | all-the-icons-dired-mode | auto-revert-mode |

